# Install command-line tools using Homebrew
# Usage: `brew bundle Brewfile`

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'aspnet/dnx'
tap 'homebrew/php'
tap 'homebrew/services'

# Install wget with IRI support
brew 'wget', args: ['--enable-iri']

# Install more recent versions of some OS X tools
brew 'vim', args: ['--override-system-vi']

# Install Bash 4
# Note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before running `chsh`.
brew 'bash'
brew 'bash-completion'

# Install Database servers
brew 'postgresql'
brew 'postgis'

# Install PHP environment
brew 'php55', args: ['--with-pgsql']
brew 'composer'
brew 'php-code-sniffer'

# Install Ruby environment
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-default-gems'
brew 'rbenv-gem-rehash'
brew 'rbenv-vars'

# Install .Net environment
brew 'dnvm'

# Install VM and provisioning tools
brew 'ansible'

# Install other useful binaries
brew 'git'
brew 'imagemagick', args: ['--with-webp']
brew 'node'
brew 'pngcrush'
brew 'ssh-copy-id'

# Development Tools
cask 'atom'
cask 'diffmerge'
cask 'java'
cask 'pgadmin3'
cask 'sourcetree'
cask 'sublime-text3'
cask 'vagrant'
cask 'virtualbox'

# Other Productivity Tools
# cask 'chicken'
cask 'dropbox'
cask 'evernote'
#cask 'firefox'
cask 'garmin-express'
# #cask 'google-chrome'
cask 'gpgtools'
cask 'minecraft'
cask 'openoffice'
# cask 'seafile-client'
cask 'skype'
cask 'spotify'
cask 'transmission'
cask 'ynab'

# Nice fonts
cask 'font-inconsolata'
cask 'font-source-code-pro'
